; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj2 obj18 - airport
	obj1 obj3 - city
	obj4 obj12 obj13 - truck
	obj5 - airplane
	obj6 obj7 obj8 obj9 obj10 obj11 obj14 obj15 obj16 obj17 - package
)

(:init
	(at obj7 obj2)
	(at obj15 obj2)
	(in-city obj0 obj1)
	(at obj9 obj2)
	(at obj14 obj2)
	(at obj10 obj0)
	(at obj6 obj0)
	(at obj17 obj2)
	(at obj13 obj2)
	(at obj16 obj0)
	(at obj5 obj0)
	(at obj4 obj2)
	(at obj12 obj0)
	(in-city obj18 obj1)
	(at obj11 obj2)
	(at obj8 obj0)
	(in-city obj2 obj3)
)

(:goal (and
	(at obj14 obj0)
	(at obj9 obj0)
	(at obj10 obj2)
	(at obj16 obj2)
	(at obj8 obj2)
	(at obj7 obj0)
	(at obj15 obj0)
	(at obj17 obj0)
	(at obj6 obj2)
	(at obj11 obj0)
))
)

; plan
1. (fly obj5 obj0 obj2)
   deleted: (at obj5 obj0)
   added: (at obj5 obj2)
   goals met: 0 of 10
2. (load obj5 obj9 obj2)
   deleted: (at obj9 obj2)
   added: (in obj9 obj5)
   goals met: 0 of 10
3. (load obj5 obj7 obj2)
   deleted: (at obj7 obj2)
   added: (in obj7 obj5)
   goals met: 0 of 10
4. (load obj5 obj17 obj2)
   deleted: (at obj17 obj2)
   added: (in obj17 obj5)
   goals met: 0 of 10
5. (load obj5 obj15 obj2)
   deleted: (at obj15 obj2)
   added: (in obj15 obj5)
   goals met: 0 of 10
6. (load obj5 obj14 obj2)
   deleted: (at obj14 obj2)
   added: (in obj14 obj5)
   goals met: 0 of 10
7. (load obj5 obj11 obj2)
   deleted: (at obj11 obj2)
   added: (in obj11 obj5)
   goals met: 0 of 10
8. (fly obj5 obj2 obj0)
   deleted: (at obj5 obj2)
   added: (at obj5 obj0)
   goals met: 0 of 10
9. (unload obj5 obj9 obj0)
   deleted: (in obj9 obj5)
   added: (at obj9 obj0)
   goals met: 1 of 10
10. (load obj5 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj5)
   goals met: 1 of 10
11. (unload obj5 obj7 obj0)
   deleted: (in obj7 obj5)
   added: (at obj7 obj0)
   goals met: 2 of 10
12. (load obj5 obj6 obj0)
   deleted: (at obj6 obj0)
   added: (in obj6 obj5)
   goals met: 2 of 10
13. (unload obj5 obj17 obj0)
   deleted: (in obj17 obj5)
   added: (at obj17 obj0)
   goals met: 3 of 10
14. (load obj5 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj5)
   goals met: 3 of 10
15. (unload obj5 obj15 obj0)
   deleted: (in obj15 obj5)
   added: (at obj15 obj0)
   goals met: 4 of 10
16. (unload obj5 obj14 obj0)
   deleted: (in obj14 obj5)
   added: (at obj14 obj0)
   goals met: 5 of 10
17. (unload obj5 obj11 obj0)
   deleted: (in obj11 obj5)
   added: (at obj11 obj0)
   goals met: 6 of 10
18. (load obj5 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj5)
   goals met: 6 of 10
19. (fly obj5 obj0 obj2)
   deleted: (at obj5 obj0)
   added: (at obj5 obj2)
   goals met: 6 of 10
20. (unload obj5 obj8 obj2)
   deleted: (in obj8 obj5)
   added: (at obj8 obj2)
   goals met: 7 of 10
21. (unload obj5 obj6 obj2)
   deleted: (in obj6 obj5)
   added: (at obj6 obj2)
   goals met: 8 of 10
22. (unload obj5 obj16 obj2)
   deleted: (in obj16 obj5)
   added: (at obj16 obj2)
   goals met: 9 of 10
23. (unload obj5 obj10 obj2)
   deleted: (in obj10 obj5)
   added: (at obj10 obj2)
   goals met: 10 of 10
